#### Terraform Plan 📝 Production Environment
<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
data.genesyscloud_auth_division.Home: Reading...
module.architect_user_prompt.genesyscloud_architect_user_prompt.all_prompts["TerraformPromptA"]: Refreshing state... [id=82113696-2c30-4ba5-b09f-932bc7b0461b]
module.architect_user_prompt.genesyscloud_architect_user_prompt.all_prompts["TerraformPromptB"]: Refreshing state... [id=3ff336ac-0a26-416b-8ac5-dcc89e57990d]
module.auth_division.data.genesyscloud_auth_division_home.home: Reading...
module.auth_division.genesyscloud_auth_division.divisions["Terraform Division B"]: Refreshing state... [id=b87e02fd-25fa-432d-b625-5f94b2626fdc]
module.auth_division.genesyscloud_auth_division.divisions["Terraform Division"]: Refreshing state... [id=b8648b9c-ec95-4f47-905a-abf09fbddc1c]
module.architect_user_prompt.genesyscloud_architect_user_prompt.all_prompts["TerraformPromptC"]: Refreshing state... [id=586ba3e6-f950-4647-a7fd-0368c8b18a42]
module.telephony_did_pool.genesyscloud_telephony_providers_edges_did_pool.all_did_pool["+64198000"]: Refreshing state... [id=68099909-d10a-48aa-b3a9-bb9cc4a35c4e]
module.routing_skill.genesyscloud_routing_skill.all_skills["Terraform Skill A"]: Refreshing state... [id=f1f3498b-1ff7-43c5-950a-272e14aa5614]
module.routing_skill.genesyscloud_routing_skill.all_skills["Terraform Skill B"]: Refreshing state... [id=900e8765-24a9-4c09-9eb3-0a5ce6345efa]
module.auth_division.data.genesyscloud_auth_division_home.home: Read complete after 0s [id=e9737657-91d3-4e1c-b2ec-e96133a1a475]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_Kings Official Birthday_2"]: Refreshing state... [id=1f1eeb54-b679-463b-90cc-dc0ace3c3b5b]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_Waitangi Day_2"]: Refreshing state... [id=95063367-0c13-45da-9c85-e2165652dcb0]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_New Years Day_2"]: Refreshing state... [id=1250a189-641f-4558-ab7d-e6bf6010d3a8]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_Boxing Day_2"]: Refreshing state... [id=b719b718-c8a4-4d05-b4b2-d4a854062b47]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_Christmas_2"]: Refreshing state... [id=c7166424-d14f-4c8f-8ab5-29a8cced9756]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_Good Friday_2"]: Refreshing state... [id=78df1ebc-5fa5-44dd-b561-a42f63574f95]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["BH_M-F_0700-1700_2"]: Refreshing state... [id=46ab8472-e4d6-4de0-8cfd-b83c27099407]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_Labor Day_2"]: Refreshing state... [id=15c02068-1542-4f1e-a869-c3b97cc96bb8]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_Matariki_2"]: Refreshing state... [id=29d0c978-dde0-47cb-8621-d3f01e97ab52]
data.genesyscloud_auth_division.Home: Read complete after 1s [id=e9737657-91d3-4e1c-b2ec-e96133a1a475]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_Anzac Day_2"]: Refreshing state... [id=07cd38dd-6c35-42e6-91c8-9b2a9549fa8b]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_Day after New Years Day_2"]: Refreshing state... [id=8604f0b8-3552-4605-800a-8a1cf58e4a94]
module.architect_schedules.genesyscloud_architect_schedules.all_schedules["PH_Easter Monday_2"]: Refreshing state... [id=7bf44ccf-0a5f-4664-8da9-b2b56d456c03]
module.group.data.genesyscloud_user.group_owner["chunkeat.goh@genesys.com"]: Reading...
module.architect_datatable_tfdivision.genesyscloud_architect_datatable.datatables["datatable_sample2"]: Refreshing state... [id=5d337050-ad1b-4134-9570-9d64ed4fbc8d]
module.architect_datatable_home.genesyscloud_architect_datatable.datatables["datatable_sample"]: Refreshing state... [id=7c18c576-21e6-4c87-a0a7-1892931d12da]
module.routing_wrapupcode.genesyscloud_routing_wrapupcode.wrapup_codes["Training gap – CN"]: Refreshing state... [id=902ad685-37fa-4dd2-8963-a666e1038881]
module.routing_wrapupcode.genesyscloud_routing_wrapupcode.wrapup_codes["Can’t locate terms"]: Refreshing state... [id=2789b9e4-674d-4fc8-82a0-4aa7558e2bcd]
module.routing_skill_group.genesyscloud_routing_skill_group.all_skillgroups["Terraform_SkillGroup"]: Refreshing state... [id=ece9964b-68ee-4e2d-b00a-0414bd1c57ec]
module.group.data.genesyscloud_user.group_owner["chunkeat.goh@genesys.com"]: Read complete after 0s [id=2114846a-e39c-4a74-af2f-278b95641ed1]
module.group.genesyscloud_group.all_groups["TF Group A"]: Refreshing state... [id=21bc90e8-dce9-4214-bc3f-58560bbbd657]
module.group.genesyscloud_group.all_groups["TF Group B"]: Refreshing state... [id=0134b4fa-c5c5-4798-ad7e-dcd3619020c6]
module.architect_schedulegroups.genesyscloud_architect_schedulegroups.all_schedulegroups["Terraform_SG_2"]: Refreshing state... [id=b0065389-4f56-4458-9c8e-4b4972e92112]
module.architect_schedulegroups.genesyscloud_architect_schedulegroups.all_schedulegroups["Terraform_SG"]: Refreshing state... [id=42637bbc-5efc-48b2-96ca-b7bc1ed74601]
module.routing_queue.genesyscloud_routing_queue.all_queues["Terraform Queue B"]: Refreshing state... [id=d1f1a5a2-35ab-4f62-a9db-cdf2d8167576]
module.routing_queue.genesyscloud_routing_queue.all_queues["Terraform Queue A"]: Refreshing state... [id=50d7b5ff-60e5-476f-9b9c-af805a2c66be]
module.group_roles.data.genesyscloud_auth_division.divisions["Terraform Division"]: Reading...
module.group_roles.data.genesyscloud_auth_role.all_roles["admin"]: Reading...
module.group_roles.data.genesyscloud_auth_division.divisions["Home"]: Reading...
module.group_roles.data.genesyscloud_auth_role.all_roles["AI Agent"]: Reading...
module.group_roles.data.genesyscloud_auth_division.divisions["Terraform Division"]: Read complete after 0s [id=b8648b9c-ec95-4f47-905a-abf09fbddc1c]
module.group_roles.data.genesyscloud_auth_division.divisions["Home"]: Read complete after 0s [id=e9737657-91d3-4e1c-b2ec-e96133a1a475]
module.group_roles.data.genesyscloud_auth_role.all_roles["AI Agent"]: Read complete after 0s [id=1373089f-583c-40ba-beea-db004865dd99]
module.group_roles.data.genesyscloud_auth_role.all_roles["admin"]: Read complete after 0s [id=c867c0b4-f245-4db0-9587-2103db24c256]
module.group_roles.genesyscloud_group_roles.all_group_roles["TF Group B"]: Refreshing state... [id=0134b4fa-c5c5-4798-ad7e-dcd3619020c6]
module.group_roles.genesyscloud_group_roles.all_group_roles["TF Group A"]: Refreshing state... [id=21bc90e8-dce9-4214-bc3f-58560bbbd657]
module.flow.genesyscloud_flow.common_modules: Refreshing state... [id=58a34eeb-9a97-47cb-b6ca-e6bb57e1b9bd]
module.flow.genesyscloud_flow.iterable_flows["Terraform Flow C"]: Refreshing state... [id=a8c7f5fa-f82e-416a-8dba-06c52ead7326]
module.flow.genesyscloud_flow.iterable_flows["Terraform Flow B"]: Refreshing state... [id=7f34071f-3150-4941-a4ba-9b309841a651]
module.flow.genesyscloud_flow.iterable_flows["Terraform Flow A"]: Refreshing state... [id=2936a02d-9a4b-4d99-adde-ff8c24833682]
module.architect_ivr.genesyscloud_architect_ivr.all_ivr["Terraform_CR_2"]: Refreshing state... [id=da4c1dbd-6d3d-4f31-965c-d99bba43d66b]
module.architect_ivr.genesyscloud_architect_ivr.all_ivr["Terraform_CR"]: Refreshing state... [id=6a4a7b4d-61b6-448c-bd2c-b0772b96fc54]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.architect_datatable_home.data.genesyscloud_auth_division.division will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_auth_division" "division" {
      + id   = (known after apply)
      + name = "Home"
    }

  # module.architect_datatable_home.genesyscloud_architect_datatable.datatables["datatable_sample"] will be updated in-place
  ~ resource "genesyscloud_architect_datatable" "datatables" {
      ~ division_id = "e9737657-91d3-4e1c-b2ec-e96133a1a475" -> (known after apply)
        id          = "7c18c576-21e6-4c87-a0a7-1892931d12da"
        name        = "datatable_sample"

        # (4 unchanged blocks hidden)
    }

  # module.architect_datatable_tfdivision.data.genesyscloud_auth_division.division will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_auth_division" "division" {
      + id   = (known after apply)
      + name = "Terraform Division"
    }

  # module.architect_datatable_tfdivision.genesyscloud_architect_datatable.datatables["datatable_sample2"] will be updated in-place
  ~ resource "genesyscloud_architect_datatable" "datatables" {
      ~ division_id = "b8648b9c-ec95-4f47-905a-abf09fbddc1c" -> (known after apply)
        id          = "5d337050-ad1b-4134-9570-9d64ed4fbc8d"
        name        = "datatable_sample2"

        # (4 unchanged blocks hidden)
    }

  # module.architect_ivr.data.genesyscloud_flow.closed_flow["Terraform Flow A"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_flow" "closed_flow" {
      + id   = (known after apply)
      + name = "Terraform Flow A"
      + type = "INBOUNDCALL"
    }

  # module.architect_ivr.data.genesyscloud_flow.open_flow["Terraform Flow A"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_flow" "open_flow" {
      + id   = (known after apply)
      + name = "Terraform Flow A"
      + type = "INBOUNDCALL"
    }

  # module.architect_ivr.data.genesyscloud_flow.open_flow["Terraform Flow B"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_flow" "open_flow" {
      + id   = (known after apply)
      + name = "Terraform Flow B"
      + type = "INBOUNDCALL"
    }

  # module.architect_ivr.genesyscloud_architect_ivr.all_ivr["Terraform_CR"] will be updated in-place
  ~ resource "genesyscloud_architect_ivr" "all_ivr" {
      ~ closed_hours_flow_id = "2936a02d-9a4b-4d99-adde-ff8c24833682" -> (known after apply)
        id                   = "6a4a7b4d-61b6-448c-bd2c-b0772b96fc54"
        name                 = "Terraform_CR"
      ~ open_hours_flow_id   = "2936a02d-9a4b-4d99-adde-ff8c24833682" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.architect_ivr.genesyscloud_architect_ivr.all_ivr["Terraform_CR_2"] will be updated in-place
  ~ resource "genesyscloud_architect_ivr" "all_ivr" {
        id                 = "da4c1dbd-6d3d-4f31-965c-d99bba43d66b"
        name               = "Terraform_CR_2"
      ~ open_hours_flow_id = "7f34071f-3150-4941-a4ba-9b309841a651" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.architect_schedulegroups.data.genesyscloud_auth_division.divisions["Home"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_auth_division" "divisions" {
      + id   = (known after apply)
      + name = "Home"
    }

  # module.architect_schedulegroups.data.genesyscloud_auth_division.divisions["Terraform Division"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_auth_division" "divisions" {
      + id   = (known after apply)
      + name = "Terraform Division"
    }

  # module.architect_schedulegroups.genesyscloud_architect_schedulegroups.all_schedulegroups["Terraform_SG"] will be updated in-place
  ~ resource "genesyscloud_architect_schedulegroups" "all_schedulegroups" {
      ~ division_id          = "e9737657-91d3-4e1c-b2ec-e96133a1a475" -> (known after apply)
        id                   = "42637bbc-5efc-48b2-96ca-b7bc1ed74601"
        name                 = "Terraform_SG"
        # (4 unchanged attributes hidden)
    }

  # module.architect_schedulegroups.genesyscloud_architect_schedulegroups.all_schedulegroups["Terraform_SG_2"] will be updated in-place
  ~ resource "genesyscloud_architect_schedulegroups" "all_schedulegroups" {
      ~ division_id          = "b8648b9c-ec95-4f47-905a-abf09fbddc1c" -> (known after apply)
        id                   = "b0065389-4f56-4458-9c8e-4b4972e92112"
        name                 = "Terraform_SG_2"
        # (4 unchanged attributes hidden)
    }

  # module.auth_division.genesyscloud_auth_division.divisions["Terraform Division C"] will be created
  + resource "genesyscloud_auth_division" "divisions" {
      + id   = (known after apply)
      + name = "Terraform Division C"
    }

  # module.routing_queue.data.genesyscloud_architect_user_prompt.user_prompts["TerraformPromptB"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_architect_user_prompt" "user_prompts" {
      + id   = (known after apply)
      + name = "TerraformPromptB"
    }

  # module.routing_queue.data.genesyscloud_auth_division.divisions["Home"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_auth_division" "divisions" {
      + id   = (known after apply)
      + name = "Home"
    }

  # module.routing_queue.genesyscloud_routing_queue.all_queues["Terraform Queue A"] will be updated in-place
  ~ resource "genesyscloud_routing_queue" "all_queues" {
      ~ division_id                      = "e9737657-91d3-4e1c-b2ec-e96133a1a475" -> (known after apply)
        id                               = "50d7b5ff-60e5-476f-9b9c-af805a2c66be"
        name                             = "Terraform Queue A"
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.routing_queue.genesyscloud_routing_queue.all_queues["Terraform Queue B"] will be updated in-place
  ~ resource "genesyscloud_routing_queue" "all_queues" {
      ~ division_id                      = "e9737657-91d3-4e1c-b2ec-e96133a1a475" -> (known after apply)
        id                               = "d1f1a5a2-35ab-4f62-a9db-cdf2d8167576"
        name                             = "Terraform Queue B"
      ~ whisper_prompt_id                = "3ff336ac-0a26-416b-8ac5-dcc89e57990d" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.routing_skill_group.data.genesyscloud_auth_division.divisions["Home"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_auth_division" "divisions" {
      + id   = (known after apply)
      + name = "Home"
    }

  # module.routing_skill_group.data.genesyscloud_auth_division.divisions["Terraform Division"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_auth_division" "divisions" {
      + id   = (known after apply)
      + name = "Terraform Division"
    }

  # module.routing_skill_group.genesyscloud_routing_skill_group.all_skillgroups["Terraform_SkillGroup"] will be updated in-place
  ~ resource "genesyscloud_routing_skill_group" "all_skillgroups" {
      ~ division_id         = "b8648b9c-ec95-4f47-905a-abf09fbddc1c" -> (known after apply)
        id                  = "ece9964b-68ee-4e2d-b00a-0414bd1c57ec"
      ~ member_division_ids = [
          - "b8648b9c-ec95-4f47-905a-abf09fbddc1c",
          - "e9737657-91d3-4e1c-b2ec-e96133a1a475",
        ] -> (known after apply)
        name                = "Terraform_SkillGroup"
        # (1 unchanged attribute hidden)
    }

  # module.routing_wrapupcode.data.genesyscloud_auth_division.divisions["Terraform Division"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "genesyscloud_auth_division" "divisions" {
      + id   = (known after apply)
      + name = "Terraform Division"
    }

  # module.routing_wrapupcode.genesyscloud_routing_wrapupcode.wrapup_codes["Can’t locate terms"] will be updated in-place
  ~ resource "genesyscloud_routing_wrapupcode" "wrapup_codes" {
      ~ division_id = "b8648b9c-ec95-4f47-905a-abf09fbddc1c" -> (known after apply)
        id          = "2789b9e4-674d-4fc8-82a0-4aa7558e2bcd"
        name        = "Can’t locate terms"
    }

Plan: 1 to add, 10 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Environment: `production`*
*Region: `ap-southeast-2`*
*Pushed by: @darbyje, Action: `pull_request`*